// src/components/carData.ts

export const carData: {
    [key: string]: {
      [key: string]: string[];
    };
  } = {
    현대: {
      "아반떼 AD": ["가솔린 1.6", "가솔린 터보 1.6", "다젤 1.6"],
      "더 뉴 아반떼(AD)": ["가솔린 1.6", "가솔린 터보 1.6", "디젤 1.6"],
      "아반떼(CN7)": ["가솔린 1.6 하이브리드", "가솔린 1.6", "가솔린 터보 1.6 (N라인)", "LPG 1.6"],
      "아반떼 N(CN7)": ["가솔린 터보 2.0"],
      "더 뉴 아반떼" : ["가솔린 1.6 하이브리드", "가솔린 1.6",  "LPG 1.6"],
      "LF소나타": ["가솔린", "가솔린 터보", "디젤", "LPG 2.0", "2.0 하이브리드", "PHEV"],
      "쏘나타 뉴 라이즈": ["가솔린 2.0", "가솔린 터보 1.6", "디젤 1.7", "LPG 2.0", "2.0 하이브리드", "PHEV"],
    //   "LF소나타": ["가솔린", "가솔린 터보", "디젤", "LPG 2.0", "2.0 하이브리드"],
      "쏘나타(DN8)": ["가솔린 2.0", "가솔린 터보 1.6", "가솔린 터보 2.5(N라인)", "가솔린 2.0 하이브리드", "LPI 2.0"],
      "쏘나타 디 엣지": ["가솔린 2.0", "가솔린 터보 1.6(N라인)", "가솔린 터보 2.5(N라인)", "가솔린 2.0 하이브리드", "LPI 2.0"]
    },
    기아: {
        "더 뉴 K3(YD)": ["4도어 가솔린 1.6", "4도어 디젤 1.6", "5도어 가솔린 1.6"],
        "올 뉴 K3(BD)": ["가솔린 1.6"],
        "더 뉴 K3(BD)": ["가솔린 1.6", "가솔린 터보 1.6(GT 5도어"],
        "K5(JF)": ["가솔린 터보 1.6", "가솔린 2.0", "가솔린 터보 2.0", "디젤 1.7", "가솔린 2.0 PHEV", "가솔린 2.0 HEV"],
        "K5(DL3)": ["가솔린 2.0 하이브리드", "가솔린 터보 1.6", "가솔린 2.0"],
        "K5": ["가솔린 2.0 하이브리드", "가솔린 터보 1.6", "가솔린 2.0"],
        K7: ["2.0 LPI", "3.0 LPI", "2.0 GDI", "3.0 GDI", "2.0 하이브리드"],
      },
    르노삼성: {
      QM6: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
      SM6: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"],
    },
    제네시스: {
        G70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G90: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV60: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"],
        GV80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"]
    },
    BMW: {
        G70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G90: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV60: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"],
        GV80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"]
    },
    테슬라: {
        G70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G90: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV60: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"],
        GV80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"]
    },
    벤츠: {
        G70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        G90: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV60: ["2.0 LPI LE", "2.0 LPI RE", "2.0 LPI LE 시그니처"],
        GV70: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"],
        GV80: ["2.0 LPI LE", "2.0 LPI RE", "2.0 GDI RE"]
    }
  };
  